wercool/valter/software/microcontroller/ARM/samba/applets/sam3n/libraries/libchip_atsam3n/chip.h
/* ----------------------------------------------------------------------------
 *         ATMEL Microcontroller Software Support
 * ----------------------------------------------------------------------------
 * Copyright (c) 2011, Atmel Corporation
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Atmel's name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ----------------------------------------------------------------------------
 */
#ifndef _LIB_ATSAM3N_
#define _LIB_ATSAM3N_

/*
 * Peripherals registers definitions
 */
#if defined atsam3n4
    #include <include/ATSAM3N4.h>
#elif defined atsam3n2
    #include <include/ATSAM3N2.h>
#elif defined atsam3n1
    #include <include/ATSAM3N1.h>
#else
    #warning Library does not support the specified chip, specifying atsam3n4.
    #define atsam3n4
    #include <include/ATSAM3N4.h>
#endif

/* Define NO_INIT attribute */
#if defined   ( __CC_ARM   )
    #define NO_INIT
#elif defined ( __ICCARM__ )
    #define NO_INIT __no_init
#elif defined (  __GNUC__  )
    #define NO_INIT
#endif

/*
 * Core
 */

/*
 * Peripherals
 */
#include <include/async.h>
#include <include/efc.h>
#include <include/flashd.h>
#include <include/pio.h>
#include <include/pmc.h>
#include <include/spi.h>
#include <include/spi_pdc.h>
#include <include/twi.h>
#include <include/twid.h>
#include <include/usart.h>
#include <include/trace.h>
#include <include/wdt.h>

#endif /* _LIB_ATSAM3N_ */
